from main import *


if __name__ == "__main__":
    ht = SportsHashTable()

    sports = [
        ("Футбол", "Игра 11x11 с мячом"),
        ("Баскетбол", "Игра с кольцами"),
        ("Волейбол", "Игра через сетку"),
        ("Хоккей", "Игра на льду"),
        ("Теннис", "Игра с ракетками"),
        ("Бокс", "Кулачный бой"),
        ("Плавание", "Водный спорт"),
        ("Гимнастика", "Упражнения"),
        ("Биатлон", "Лыжи и стрельба"),
        ("Регби", "Силовая игра")
    ]

    for name, desc in sports:
        ht.insert(name, desc)

    print("Исходная таблица:")
    ht.print_table()

    ht.delete("Волейбол")
    print("\nПосле удаления Волейбола:")
    ht.print_table()

    ht.update("Футбол", "Международный футбол: 11 игроков, мяч, ворота")
    print("\nПосле обновления Футбола:")
    ht.print_table()